---
kind: type
id: T:Autodesk.Revit.DB.Events.PreDocEventArgs
source: html/c386eb8b-9037-b5f7-c6f9-0816d222551a.htm
---
# Autodesk.Revit.DB.Events.PreDocEventArgs

The class is used as base class for the arguments of any pre-event arguments that is associated to a particular Document.

## Syntax (C#)
```csharp
public class PreDocEventArgs : PreEventArgs
```